In [1]:
import pandas as pd

In [2]:
data = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Sara'],
    'Edad': [25, 30, 22, 27],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Sevilla']
}

In [3]:
df = pd.DataFrame(data)
df

   Nombre  Edad     Ciudad
0     Ana    25     Madrid
1    Luis    30  Barcelona
2  Carlos    22   Valencia
3    Sara    27    Sevilla

In [4]:
df['Salario'] = [30000, 45000, 38000, 32000]
df

   Nombre  Edad     Ciudad  Salario
0     Ana    25     Madrid    30000
1    Luis    30  Barcelona    45000
2  Carlos    22   Valencia    38000
3    Sara    27    Sevilla    32000

In [5]:
df['Meses'] = [12, 9, 11, 10]
df

   Nombre  Edad     Ciudad  Salario  Meses
0     Ana    25     Madrid    30000     12
1    Luis    30  Barcelona    45000      9
2  Carlos    22   Valencia    38000     11
3    Sara    27    Sevilla    32000     10

In [6]:
df['Catorceavo'] = (df['Salario'] / 12) * df['Meses']
df

   Nombre  Edad     Ciudad  Salario  Meses    Catorceavo
0     Ana    25     Madrid    30000     12  30000.000000
1    Luis    30  Barcelona    45000      9  33750.000000
2  Carlos    22   Valencia    38000     11  34833.333333
3    Sara    27    Sevilla    32000     10  26666.666667

In [7]:
df['Salario'] = df['Salario'] + 2000
df

   Nombre  Edad     Ciudad  Salario  Meses    Catorceavo
0     Ana    25     Madrid    32000     12  30000.000000
1    Luis    30  Barcelona    47000      9  33750.000000
2  Carlos    22   Valencia    40000     11  34833.333333
3    Sara    27    Sevilla    34000     10  26666.666667

In [8]:
nombres = df['Nombre']
nombres

0       Ana
1      Luis
2    Carlos
3      Sara
Name: Nombre, dtype: object

In [9]:
nombre_catorceavo = df[['Nombre', "Catorceavo"]]
nombre_catorceavo

   Nombre    Catorceavo
0     Ana  30000.000000
1    Luis  33750.000000
2  Carlos  34833.333333
3    Sara  26666.666667

In [10]:
menores_30 = df[df['Edad'] < 30]
menores_30

   Nombre  Edad    Ciudad  Salario  Meses    Catorceavo
0     Ana    25    Madrid    32000     12  30000.000000
2  Carlos    22  Valencia    40000     11  34833.333333
3    Sara    27   Sevilla    34000     10  26666.666667

In [11]:
print(type(df))
print(type(menores_30))
print(type(nombre_catorceavo))
print(type(nombres))
print(type(df['Nombre']))
print(type(df['Catorceavo']))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>